In [229]:
import numpy as np
import pandas as pd
import ast
from pandas.io.json import json_normalize

path = '/content/query_result_2020-07-10T11_58_44.440082Z.csv'

In [230]:
dataframe = pd.read_csv(path, usecols = ['User ID','Response'])

In [231]:
dataframe['Response'] = dataframe['Response'].apply(lambda data_entry : ast.literal_eval(str(data_entry)))

In [232]:
dataframe2 = json_normalize(dataframe['Response'])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  """Entry point for launching an IPython kernel.

In [233]:
dataframe2 = pd.concat([dataframe['User ID'],dataframe2['data']],axis=1)

In [234]:
dataframe2 = dataframe2[dataframe2['data'].notnull()]

In [235]:
dataframe2.index = pd.RangeIndex(start = 0,stop=dataframe2.shape[0],step=1)

In [236]:
bank_names = []
account_nos =[]
account_name =[]
salary = []

for data_index in range(dataframe2.shape[0]):
  bank_names.append(dataframe2['data'][data_index][0]['bankName'])
  account_nos.append(dataframe2['data'][data_index][0]['accountNumber'])
  account_name.append(dataframe2['data'][data_index][0]['accountName'])
  if dataframe2['data'][data_index][0]['salary']:
    salary.append(dataframe2['data'][data_index][0]['salary'][-1]['totalSalary'])
  else:
    salary.append(-1)

In [237]:
#account_name = np.array(account_name)
#account_nos = np.array(account_nos)
#bank_names = np.array(bank_names)
#salary = np.array(salary)

In [238]:
final_dataframe = pd.DataFrame({'User-ID':dataframe2['User ID'],'Bank-Name':np.array(bank_names),'Account-Holder-Name':np.array(account_name),'Account-No':np.array(account_nos),'Recent-Salary':np.array(salary)})

In [239]:
final_dataframe

     User-ID           Bank-Name  ...         Account-No Recent-Salary
0     104832                HDFC  ...     50100287183763       11553.0
1     434859  STANDARD CHARTERED  ...        27011717278       18271.0
2     293921                HDFC  ...     50100330886677       17436.0
3     172850               ICICI  ...       197401503617          -1.0
4      63085               ICICI  ...       059601506728          -1.0
..       ...                 ...  ...                ...           ...
314   321522                IDFC  ...        10038821419       14078.0
315   293171               ICICI  ...       001401538521       41627.0
316   539352                 SBI  ...  00000062308585354          -1.0
317   103270                HDFC  ...     50100257779051       27500.0
318   540212                HDFC  ...     50100199646413       32476.0

[319 rows x 5 columns]

In [240]:
#final_df.to_csv('v5_final.csv',index=False)